'''
Задача на проверку правильности логической формулы
'''

# def f(x,y,A):
#     return ((x < 5) <= (x**2 < A)) and ((y**2 <= A) <= (y <= 5))
#
# result = []
#
# for A in range(1,1000):
#     flag = True
#     for x in range(1,1000):
#         for y in range(1, 1000):
#             if not f(x,y,A):
#                 flag = False
#                 break
#     if flag:
#         print(A)
#         result.append(A)
# print(len(result))

#______________________________________________________________________________________________________________________
#______________________________________________________________________________________________________________________

# Р-33.  (С.С. Поляков) Укажите наибольшее целое значение А, при котором выражение
# (y – x  5) ∨ (A < 2x3 + y) ∨ (A < y2 + 16)
#истинно для любых целых положительных значений x и y.
# def F(y,x, A):
#     return (y - x != 5) or (A < 2 * x ** 3 + y) or (A < y ** 2 + 16)
#
# for A in range(1, 1000):
#     flag = True
#     for y in range(1, 1000):
#         for x in range(1, 1000):
#             if not F(y,x,A):
#                 flag = False
#                 break
#     if flag:
#         print(A)
#______________________________________________________________________________________________________________________
#______________________________________________________________________________________________________________________
# Р-35  (демо-2021). Обозначим через ДЕЛ(n,m) утверждение «натуральное число n делится без
# остатка на натуральное число m». Для какого наибольшего натурального числа А формула
# ¬ДЕЛ(x,А)(ДЕЛ(x,6) ¬ДЕЛ(x,9))
# тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?
# def Del(n, m):
#     return n % m == 0
#
# def F(x, A):
#     return (not Del(x, A)) <= (Del(x, 6) <= (not Del(x,9)))
#
# for A in range(1, 1000):
#     flag = True
#     for x in range(1, 1000):
#         if not F(x,A):
#                 flag = False
#                 break
#     if flag:
#         print(A)
# ______________________________________________________________________________________________________________________
# ______________________________________________________________________________________________________________________
# Р-18. Пусть P – множество всех 8-битовых цепочек, начинающихся с 1,  Q – множество всех 8-битовых цепочек, оканчивающихся на 000,
# а A – некоторое множество произвольных 8-битовых цепочек. Сколько элементов содержит минимальное множество A,
# при котором для любой 8-битовой цепочки x истинно выражение
# ¬(x принадлежит A) <= (¬(x принадлежит P) v (x принадлежит Q))
# (x принадлежит A) v ¬(x принадлежит P) v (x принадлежит Q) = 1

# x принадлежит A = A
# A v not P v Q = 1
# 1 0 0 0 0 0 0 0   128
# 1 1 1 1 1 1 1 1   255
# * * * * * 0 0 0
# not in
# P = {i for i in range(128, 256)}  # 0 127
# Q = {i for i in range(0, 256, 8)}
# print(len(P - Q))