# https://kpolyakov.spb.ru/school/ege.htm
# http
# ftp
#
# IP - 32 бит
# 8бит.8бит.8бит.8бит
# 00000000.мин
# 11111111.макс
# 0-255.0-255.0-255.0-255
# сеть и подсеть
# 255.255.255.0
# 11111111.11111111.11111111.00000000
#
# 192.168.3.1
# 11000000.10101000.00000011.00000001
#
# 192.168.3.23
# 11000000.10101000.00000011.00010111

#Р-13. Для узла с IP-адресом 15.51.208.15 адрес сети равен 15.51.192.0.
# Найдите наименьшее возможное количество единиц в двоичной записи маски подсети.

from ipaddress import *
for i in range(32):
  net = ip_network("15.51.208.15/" + str(i),0)
  print(net)
  param = str(net).split('/')
  print(param)
  if param[0] == "15.51.192.0":
    param_10 = int(net.netmask)
    print(param_10)
    param_2 = bin(param_10)[2:]
    print(param_2)
    print(param_2.count('1'))
    break