#39)	Найдите основание системы счисления, в которой выполнено умножение: 3·213 = 1043.

# for N in range(2,36):
#     x1 = 3
#     x2 = 213
#     x3 = 1043
#     x_1_str = ''
#     x_2_str = ''
#     x_3_str = ''
#     while x1 > 0:
#         x_1_str += str(x1 % N)
#         x1 //= N
#     x_1_str = x_1_str[::-1]
#     while x2 > 0:
#         x_2_str += str(x2 % N)
#         x2 //= N
#     x_2_str = x_2_str[::-1]
#     while x3 > 0:
#         x_3_str += str(x3 % N)
#         x3 //= N
#     x_3_str = x_3_str[::-1]
#     if int(x_1_str, N) * int(x_2_str, N) == int(x_3_str,N):
#         print(N)
#




# Найти сумму восьмеричных чисел 178 +1708 +17008 +...+17000008,
# перевести в 16-ую систему счисления. Найдите в записи числа, равного этой сумме,
# третью цифру слева.
#
# a = '17'
# b = '1700000'
#
# summ = 0
# while a <= b:
#     summ += int(a,8)
#     a += '0'
#
# number_16 = hex(summ)[2:]
# print(number_16[2])


#Чему равно наименьшее основание позиционной системы счисления
# , при котором 225x = 405y? Ответ записать в виде целого числа.

for x in range(6, 100):
    for y in range(6, 100):
        if (2 * x ** 2 + 2*x + 5) == (4 * y ** 2 + 5):
            print(x)
            break

